Revit 2027 API
BuiltInFailures.DesignOptionFailures.SelectionIncludesOptionItems Property
 Elements that were already in a Design Option were selected. These will not be added to the Option Set.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId SelectionIncludesOptionItems { get; }
Public Shared ReadOnly Property SelectionIncludesOptionItems As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ SelectionIncludesOptionItems {
	FailureDefinitionId^ get ();
}
static member SelectionIncludesOptionItems : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.DesignOptionFailures Class
Autodesk.Revit.DB Namespace